
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiHaba/aws-ecs-terraform/actions/runs/10322032764)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.ecs_task_execution_policy: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-simple-server]
data.aws_iam_policy_document.ecs_task_assume: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d3bc6321415261f2]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_task_execution_policy: Read complete after 0s [id=1077804475]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-simple-server]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c861b2c5fa1a1383]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d739af6509c77909]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0be0afc03eb19635a]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d723ee54653a8d31]
aws_lb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:targetgroup/go-simple-server-target-group/365fcf4d3641bd97]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-013e3158ba1d87cb8]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-051818b3ca2c1050c]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e85ff5b730879868]
aws_security_group.ecs: Refreshing state... [id=sg-085b65b04939915ca]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0094ede6f5e9b43a2]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a24704fbcf978b51]
aws_security_group.alb: Refreshing state... [id=sg-0dc0aa69fd5dd1046]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0539410e12d384fea]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0bbc16a37d4945990]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-08d01b6dbc301047e]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02dc7c60bbde05715]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0094ede6f5e9b43a21080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-014f5e9d65c806c81]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09f94a0ef2185be8f]
aws_security_group_rule.alb_to_ecs: Refreshing state... [id=sgrule-1428484681]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:loadbalancer/app/go-simple-server-alb/7dba8af0f101d717]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02b5f438bd818005a]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ae73b39760ada660]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-068c3b626f7c89750]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d3652fd8c583d1bc]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d739af6509c779091080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0e85ff5b7308798681080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:listener/app/go-simple-server-alb/7dba8af0f101d717/b0567004bccb307c]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:listener-rule/app/go-simple-server-alb/7dba8af0f101d717/b0567004bccb307c/e8df5ab9d24c6a19]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/go-simple-server"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "go-simple-server"
      + tags_all = (known after apply)

      + setting (known after apply)
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-simple-server"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-simple-server"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:533267095025:targetgroup/go-simple-server-target-group/365fcf4d3641bd97"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-085b65b04939915ca",
            ]
          + subnets          = [
              + "subnet-0539410e12d384fea",
              + "subnet-0bbc16a37d4945990",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu              = 0
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-simple-server"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-simple-server"
                        }
                    }
                  + name             = "go-simple-server"
                  + portMappings     = [
                      + {
                          + appProtocol   = ""
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = ""
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "go-simple-server"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_role.ecs will be created
  + resource "aws_iam_role" "ecs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "go-simple-server-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "go-simple-server-ecs"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
aws_cloudwatch_log_group.cloudwatch_log_group: Creating...
aws_ecs_cluster.ecs_cluster: Creating...
aws_iam_role.ecs_task_execution_role: Creating...
aws_iam_role.ecs: Creating...
aws_iam_role.ecs: Creation complete after 0s [id=go-simple-server-ecs]
aws_iam_role.ecs_task_execution_role: Creation complete after 0s [id=go-simple-server-ecs-task]
aws_iam_role_policy_attachment.ecs_task_execution_policy_attachment: Creating...
aws_iam_role_policy_attachment.ecs_task_execution_policy_attachment: Creation complete after 0s [id=go-simple-server-ecs-20240809155008223700000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Creation complete after 1s [id=/aws/ecs/go-simple-server]
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-simple-server]
aws_ecs_cluster.ecs_cluster: Still creating... [10s elapsed]
aws_ecs_cluster.ecs_cluster: Creation complete after 12s [id=arn:aws:ecs:ap-northeast-1:533267095025:cluster/go-simple-server]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:533267095025:service/go-simple-server/go-simple-server]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":8,"Program":"tfcmt","SHA1":"d7324b3973423fa0ba2c33125285afedc1bce1d2","Vars":{},"WorkflowName":"Terraform CI/CD"} -->